evgmolt/Tonometer/gd32f303_v1/src/main.c
							for (int f=0;f<size_pack;f++){
									int16_t cur_press=(((save_clear[count_send_bluetooth*size_pack+f]-i2c_out_K)*100)/rate);
									cur_buff_ble[6+f*2]=cur_press&0xFF;
									cur_buff_ble[6+f*2+1]=(cur_press>>8)&0xFF;
							}							
							for (int f=0;f<size_pack*2+6;f++){
									c_summ+=cur_buff_ble[f];
							}
							cur_buff_ble[size_pack*2+6]=c_summ;
							my_send_string_UART_0(cur_buff_ble,size_pack*2+6+1);
							count_send_bluetooth++;
					}
					if (current_pressure <= STOP_MEAS_LEVEL){
							//timer_2_stop();						                           ///////////////////////////////////////////////

  						for (int i = 0; i < AVER_SIZE; i++) {
								ArrayForAver[i] = 0;
							}
						
							ILI9341_FillRectangle(55, 10, 180, 106, ILI9341_WHITE);
							ILI9341_FillRectangle(55, 120, 180, 106, ILI9341_WHITE);
							ILI9341_FillRectangle(112, 250, 123, 64, ILI9341_WHITE);	
						
							str_clear(EnvelopeArray,10000);
							GetArrayOfWaveIndexes(save_dir, puls_buff, puls_buff_NEW);
							f_sorting_MAX();
							CountEnvelopeArray(puls_buff_NEW,puls_buff_AMP);
							f_PSys_Dia();
							puls_convert();	
							bonus_byte=0;
							if (main_index>1000 & 
									PSys > MIN_SYS & 
									PSys < MAX_SYS & 
									PDia > MIN_DIA & 
									PDia < MAX_DIA & 
									puls_out > MIN_PULSE & 
									puls_out < MAX_PULSE) {
										print_sys_label();
										print_dia_label();	
										print_SYS(PSys);
										print_DIA(PDia);									
										print_num_H((int16_t)puls_out,235,250,BLACK);
									
										cur_tim = rtc_counter_get();
										m_hh = cur_tim / 3600;
										m_mm = (cur_tim % 3600) / 60;
										m_ss = (cur_tim % 3600) % 60;
										check_backup_register(&cur_day, &cur_month, &cur_year);
										if 	(cur_year>=255)	cur_year-=2000;
							}
							else {
									bonus_byte|=0x80;
									print_error(4);							
							}
							send_result_measurement((uint8_t)cur_day, (uint8_t)cur_month, (uint8_t)cur_year, (uint8_t)m_ss, (uint8_t)m_mm, (uint8_t)m_hh, (uint8_t)PSys, (uint8_t)PDia, (uint8_t)puls_out,bonus_byte);
							
							VALVE_1_OFF;
							VALVE_2_OFF;
							mode = SEND_SAVE_BUFF_MSG;								
							timer_1_start();
					}					
					break;
				case SEND_SAVE_BUFF_MSG:
					shutdown_counter = 0;
					break;
			}
			
			if (UART0_flag==1){					
					for (int w=0;w<200;w++){
							if (finder_msg(UART0_buff)){																	
									ILI9341_FillRectangle(1, 1, 100, 100, ILI9341_RED);															
							}
							if (finder(UART0_buff, "OFF",0,&num_string)) {
									ILI9341_FillRectangle(1, 1, 100, 100, ILI9341_WHITE);
							}
					}
					UART0_flag=0;
			}
			
			if (Wave_ind_FLAG){				
					print_heart(true);
					delay_1ms(200);
					print_heart(false);
					Wave_ind_FLAG=0;
			}
						
			if (0U == cdc_acm_check_ready(&usbd_cdc)) {
					cdc_acm_data_receive(&usbd_cdc);
			} else {
					cdc_acm_data_send(&usbd_cdc);
			}			
    }
}

void abort_meas(void) {
		mode = START_SCREEN;
		PUMP_OFF;
		VALVE_1_OFF;
		VALVE_2_OFF;
		button_released = 0;
		button_pressed_counter = 0;
}

void i2c_config(void){
		/* enable GPIOB clock */
    rcu_periph_clock_enable(RCU_GPIOB);
		/* enable I2C0 clock */
    rcu_periph_clock_enable(RCU_I2C0);
	
	  /* connect PB6 to I2C0_SCL */
    /* connect PB7 to I2C0_SDA */
//  gpio_init(GPIOB, GPIO_MODE_AF_OD, GPIO_OSPEED_50MHZ, GPIO_PIN_6 | GPIO_PIN_7);
		gpio_init(GPIOB, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_6 | GPIO_PIN_7);
	
    /* cofigure I2C clock */
    i2c_clock_config(I2C0, 100000, I2C_DTCY_2);
    /* cofigure I2C address */
    i2c_mode_addr_config(I2C0, I2C_I2CMODE_ENABLE, I2C_ADDFORMAT_7BITS, I2C0_OWN_ADDRESS7);
    /* enable I2C0 */
    i2c_enable(I2C0);
    /* enable acknowledge */
    i2c_ack_config(I2C0, I2C_ACK_ENABLE);
}

void SIM_recieve_OK(void){
		usbd_ep_send (&usbd_cdc, CDC_IN_EP, "OK", 3);
}

void ADS1115_config(uint8_t pointer, uint8_t byte1, uint8_t byte2){
		/* wait until I2C bus is idle */
    while(i2c_flag_get(I2C0, I2C_FLAG_I2CBSY));
    /* send a start condition to I2C bus */
    i2c_start_on_bus(I2C0);
    /* wait until SBSEND bit is set */
    while(!i2c_flag_get(I2C0, I2C_FLAG_SBSEND));
		
		/* send slave address to I2C bus */
    i2c_master_addressing(I2C0, I2C0_SLAVE_ADDRESS7, I2C_TRANSMITTER);
    /* wait until ADDSEND bit is set */
    while(!i2c_flag_get(I2C0, I2C_FLAG_ADDSEND));
    /* clear ADDSEND bit */
    i2c_flag_clear(I2C0, I2C_FLAG_ADDSEND);
    /* wait until the transmit data buffer is empty */
    while(!i2c_flag_get(I2C0, I2C_FLAG_TBE));		

		i2c_data_transmit(I2C0,pointer); //0x01);
		while(!i2c_flag_get(I2C0, I2C_FLAG_TBE)){}
		i2c_data_transmit(I2C0, byte1); //0x8F);
		while(!i2c_flag_get(I2C0, I2C_FLAG_TBE)){}				
		i2c_data_transmit(I2C0, byte2); //0xA3);
		while(!i2c_flag_get(I2C0, I2C_FLAG_TBE)){}		
		
    /* send a stop condition to I2C bus */
    i2c_stop_on_bus(I2C0);
    /* wait until stop condition generate */
    while(I2C_CTL0(I2C0) & 0x0200);				
}

uint8_t ADS1115_read_IT(void){
		if (gpio_input_bit_get(GPIOB, GPIO_PIN_10)==0){
				while(i2c_flag_get(I2C0, I2C_FLAG_I2CBSY));
				/* send a start condition to I2C bus */
				i2c_start_on_bus(I2C0);
				/* wait until SBSEND bit is set */
				while(!i2c_flag_get(I2C0, I2C_FLAG_SBSEND));		
				/* send slave address to I2C bus */
				i2c_master_addressing(I2C0, I2C0_SLAVE_ADDRESS7, I2C_TRANSMITTER);
				/* wait until ADDSEND bit is set */
				while(!i2c_flag_get(I2C0, I2C_FLAG_ADDSEND));
				/* clear ADDSEND bit */
				i2c_flag_clear(I2C0, I2C_FLAG_ADDSEND);
				/* wait until the transmit data buffer is empty */
				while(!i2c_flag_get(I2C0, I2C_FLAG_TBE));		

				i2c_data_transmit(I2C0, 0x00);
				while(!i2c_flag_get(I2C0, I2C_FLAG_TBE)){}	
				
				/* send a stop condition to I2C bus */
				i2c_stop_on_bus(I2C0);
				/* wait until stop condition generate */
				while(I2C_CTL0(I2C0) & 0x0200);	
			/* wait until I2C bus is idle */	
				while(i2c_flag_get(I2C0, I2C_FLAG_I2CBSY));		///////////////////////////////////////////////////////////////////////////
				i2c_start_on_bus(I2C0); 										
				/* wait until SBSEND bit is set */
				while(!i2c_flag_get(I2C0, I2C_FLAG_SBSEND));			
				/* send slave address to I2C bus */
				i2c_master_addressing(I2C0, I2C0_SLAVE_ADDRESS7, I2C_RECEIVER);
				/* wait until ADDSEND bit is set */
				while(!i2c_flag_get(I2C0, I2C_FLAG_ADDSEND));
				/* clear ADDSEND bit */
				i2c_flag_clear(I2C0, I2C_FLAG_ADDSEND);		
				
				/* wait until the RBNE bit is set */
				while(!i2c_flag_get(I2C0, I2C_FLAG_RBNE));
				/* read a data from I2C_DATA */
				i2c_receiver[0] = i2c_data_receive(I2C0);
				
				/* wait until the RBNE bit is set */
				while(!i2c_flag_get(I2C0, I2C_FLAG_RBNE));
				/* read a data from I2C_DATA */
				i2c_receiver[1] = i2c_data_receive(I2C0);
				
				while(!i2c_flag_get(I2C0, I2C_FLAG_BTC));
				/* disable acknowledge */
				i2c_ack_config(I2C0, I2C_ACK_DISABLE);
								
				/* send a stop condition to I2C bus */
				i2c_stop_on_bus(I2C0);
				/* wait until stop condition generate */
				while(I2C_CTL0(I2C0) & 0x0200);
				/* enable acknowledge */
				i2c_ack_config(I2C0, I2C_ACK_ENABLE);		
				
				ADS1115_config(0b00000001, Hi_ADS1115_config, Lo_ADS1115_config);
				
				return 1;
			}
		return 0;
}

void i2c_convers(void){	
		while(i2c_flag_get(I2C0, I2C_FLAG_I2CBSY));
    /* send a start condition to I2C bus */
    i2c_start_on_bus(I2C0);
    /* wait until SBSEND bit is set */
    while(!i2c_flag_get(I2C0, I2C_FLAG_SBSEND));		
		/* send slave address to I2C bus */
    i2c_master_addressing(I2C0, I2C0_SLAVE_ADDRESS7, I2C_TRANSMITTER);
    /* wait until ADDSEND bit is set */
    while(!i2c_flag_get(I2C0, I2C_FLAG_ADDSEND));
    /* clear ADDSEND bit */
    i2c_flag_clear(I2C0, I2C_FLAG_ADDSEND);
    /* wait until the transmit data buffer is empty */
    while(!i2c_flag_get(I2C0, I2C_FLAG_TBE));		

		i2c_data_transmit(I2C0, 0x00);
		while(!i2c_flag_get(I2C0, I2C_FLAG_TBE)){}	
		
    /* send a stop condition to I2C bus */
    i2c_stop_on_bus(I2C0);
    /* wait until stop condition generate */
    while(I2C_CTL0(I2C0) & 0x0200);	
	/* wait until I2C bus is idle */
    while(i2c_flag_get(I2C0, I2C_FLAG_I2CBSY));
		i2c_start_on_bus(I2C0); 										///////////////////////////////////////////////////////////////////////////
    /* wait until SBSEND bit is set */
    while(!i2c_flag_get(I2C0, I2C_FLAG_SBSEND));			
		/* send slave address to I2C bus */
		i2c_master_addressing(I2C0, I2C0_SLAVE_ADDRESS7, I2C_RECEIVER);
		/* wait until ADDSEND bit is set */
    while(!i2c_flag_get(I2C0, I2C_FLAG_ADDSEND));
    /* clear ADDSEND bit */
    i2c_flag_clear(I2C0, I2C_FLAG_ADDSEND);		
		
		/* wait until the RBNE bit is set */
		while(!i2c_flag_get(I2C0, I2C_FLAG_RBNE));
    /* read a data from I2C_DATA */
    i2c_receiver[0] = i2c_data_receive(I2C0);
		
		/* wait until the RBNE bit is set */
		while(!i2c_flag_get(I2C0, I2C_FLAG_RBNE));
    /* read a data from I2C_DATA */
    i2c_receiver[1] = i2c_data_receive(I2C0);
		
		while(!i2c_flag_get(I2C0, I2C_FLAG_BTC));
    /* disable acknowledge */
    i2c_ack_config(I2C0, I2C_ACK_DISABLE);
						
		/* send a stop condition to I2C bus */
    i2c_stop_on_bus(I2C0);
    /* wait until stop condition generate */
    while(I2C_CTL0(I2C0) & 0x0200);
    /* enable acknowledge */
    i2c_ack_config(I2C0, I2C_ACK_ENABLE);
//		i2c_transmitter[1]=0x01;
			
		/* wait until I2C bus is idle */
    while(i2c_flag_get(I2C0, I2C_FLAG_I2CBSY));
    /* send a start condition to I2C bus */
    i2c_start_on_bus(I2C0);
    /* wait until SBSEND bit is set */
    while(!i2c_flag_get(I2C0, I2C_FLAG_SBSEND));
		
		/* send slave address to I2C bus */
    i2c_master_addressing(I2C0, I2C0_SLAVE_ADDRESS7, I2C_TRANSMITTER);
    /* wait until ADDSEND bit is set */
    while(!i2c_flag_get(I2C0, I2C_FLAG_ADDSEND));
    /* clear ADDSEND bit */
    i2c_flag_clear(I2C0, I2C_FLAG_ADDSEND);
    /* wait until the transmit data buffer is empty */
    while(!i2c_flag_get(I2C0, I2C_FLAG_TBE));		

		i2c_data_transmit(I2C0, 0x01);
		while(!i2c_flag_get(I2C0, I2C_FLAG_TBE)){}
		i2c_data_transmit(I2C0, 0x8F);
		while(!i2c_flag_get(I2C0, I2C_FLAG_TBE)){}				
		i2c_data_transmit(I2C0,0xC3);//0x83);//0xC3);// 0xA3);
		while(!i2c_flag_get(I2C0, I2C_FLAG_TBE)){}		
		
    /* send a stop condition to I2C bus */
    i2c_stop_on_bus(I2C0);
    /* wait until stop condition generate */
    while(I2C_CTL0(I2C0) & 0x0200);	
}

void GPIO_config(void){
		rcu_periph_clock_enable(RCU_GPIOB);		
		gpio_init(GPIOB, GPIO_MODE_IN_FLOATING, GPIO_OSPEED_50MHZ, GPIO_PIN_0);	  //POWER_ON_DETECT
		gpio_init(GPIOB, GPIO_MODE_IPU, GPIO_OSPEED_50MHZ, GPIO_PIN_10);	//ADS_RDY  --EXTI
		gpio_init(GPIOB, GPIO_MODE_IPU, GPIO_OSPEED_50MHZ, GPIO_PIN_8);	// STDBY
		gpio_init(GPIOB, GPIO_MODE_IPU, GPIO_OSPEED_50MHZ, GPIO_PIN_9);	// CHRG
	
		rcu_periph_clock_enable(RCU_GPIOC);
		gpio_init(GPIOC, GPIO_MODE_IN_FLOATING, GPIO_OSPEED_50MHZ, GPIO_PIN_0);	  //SIM_EXT
		gpio_init(GPIOC, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_1);	  		//SIM_PWKEY
		gpio_init(GPIOC, GPIO_MODE_IPD, GPIO_OSPEED_50MHZ, GPIO_PIN_8);					//KEY IN
		gpio_init(GPIOC, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_9);	  		//POWER_ON
		gpio_init(GPIOC, GPIO_MODE_IN_FLOATING, GPIO_OSPEED_50MHZ, GPIO_PIN_10);	  //USB_ON	
		gpio_init(GPIOC, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_11);	  		//COMP_ON/OFF
		gpio_init(GPIOC, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_12);	  		//VALVE1_OP/CL
		gpio_init(GPIOC, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_13);	  		//VALVE2_OP/CL			
}

void ADC_rcu_config(void){
    /* enable GPIOA clock */
    rcu_periph_clock_enable(RCU_GPIOB);
    /* enable ADC0 clock */
    rcu_periph_clock_enable(RCU_ADC0);
    /* enable DMA0 clock */
    rcu_periph_clock_enable(RCU_DMA0);
    /* config ADC clock */
    rcu_adc_clock_config(RCU_CKADC_CKAPB2_DIV8);
}

