evgmolt/Tonometer/gd32f303_v1/src/main.c
    /* configure button pin as input */
    //gpio_init(GPIOC, GPIO_MODE_IPD, GPIO_OSPEED_50MHZ, GPIO_PIN_8);
    
		/* enable the AF clock */
		rcu_periph_clock_enable(RCU_AF);	
	
    /* enable and set key user EXTI interrupt to the lowest priority */
		nvic_priority_group_set(NVIC_PRIGROUP_PRE2_SUB2);
    nvic_irq_enable(EXTI5_9_IRQn, 2U, 2U);

    /* connect key user EXTI line to key GPIO pin */
    gpio_exti_source_select(GPIO_PORT_SOURCE_GPIOC, GPIO_PIN_SOURCE_8);

    /* configure key user EXTI line */
    exti_init(EXTI_8, EXTI_INTERRUPT, EXTI_TRIG_BOTH );
    exti_interrupt_flag_clear(EXTI_8);
}

void device_OFF(void){
		PUMP_OFF;
		VALVE_1_OFF;
		VALVE_2_OFF;
		ILI9341_FillScreen(ILI9341_BLACK);
		gpio_bit_reset(GPIOC, GPIO_PIN_9);
}

void i2c_calibration(void){
		uint8_t buff1[10]={0};
		i2c_out_K=0;
		for (int g=0;g<20;g++){			
				while (ADS1115_read_IT()==0){}
				i2c_out_K+=((i2c_receiver[0]<<8)&0xFF00)+(i2c_receiver[1]&0xFF);				
		}
		i2c_out_K = i2c_out_K/20;
}

void usb_send_i2c_convers(void){
		i2c_convers();	
		uint8_t send_buff[3]={25,i2c_receiver[1],i2c_receiver[0]};
		i2c_out=(((i2c_receiver[0]<<8)&0xFF00)+(i2c_receiver[1]&0xFF)-i2c_out_K);
		current_pressure=i2c_out/rate;
		usbd_ep_send (&usbd_cdc, CDC_IN_EP, send_buff, 3);
}

void timer_2_start(void){
		timer_interrupt_flag_clear(TIMER2, TIMER_INT_FLAG_UP);
    timer_interrupt_enable(TIMER2, TIMER_INT_UP);
    timer_enable(TIMER2);
}

void timer_2_stop(void){
	timer_disable(TIMER2);			
}

void timer_1_start(void){
		timer_interrupt_flag_clear(TIMER1, TIMER_INT_FLAG_UP);
    timer_interrupt_enable(TIMER1, TIMER_INT_UP);
    timer_enable(TIMER1);
}
void timer_1_stop(void){
	timer_disable(TIMER1);			
}

uint8_t usb_send_save(int16_t *mass1, int16_t *mass2){
	for (int h=0;h<puls_counter;h++){
			if (send_counter==indexPSys | send_counter==indexPDia | send_counter==XMax)save_dir[send_counter]=1000;					
	}		
	
	uint8_t send_H1=(mass1[send_counter]>>8)&0xFF;
	uint8_t send_L1=mass1[send_counter]&0xFF;
	uint8_t send_H2=(mass2[send_counter]>>8)&0xFF;
	uint8_t send_L2=mass2[send_counter]&0xFF;
	
	uint8_t send_buff[5]={25,send_L1,send_H1,send_L2,send_H2};
	usbd_ep_send (&usbd_cdc, CDC_IN_EP, send_buff, 5);
	send_counter++;
	if (send_counter>=main_index) return 1;
	else return 0;
}

short int convert_save_16(void){			
		if (ADS1115_read_IT()==0) return 0;

		save_clear[main_index]=(((i2c_receiver[0]<<8)&0xFF00)+(i2c_receiver[1]&0xFF)-i2c_out_K);
		if (save_clear[main_index-1]<0) save_clear[main_index-1]=0;
		main_index++;			
		return 1;
}

short int convert_NO_save(void){			
		if (ADS1115_read_IT()==0) return 0;
		i2c_out=(((i2c_receiver[0]<<8)&0xFF00)+(i2c_receiver[1]&0xFF)-i2c_out_K);
		current_pressure=i2c_out/rate;	
		return i2c_out;
}

void usb_send_16(short int T1, short int T2){
		uint8_t send_H1=(T1>>8)&0xFF;
		uint8_t send_L1=T1&0xFF;
		uint8_t send_H2=(T2>>8)&0xFF;
		uint8_t send_L2=T2&0xFF;
		uint8_t send_buff[5]={25,send_L1,send_H1,send_L2,send_H2};
		usbd_ep_send (&usbd_cdc, CDC_IN_EP, send_buff, 5);
}

uint8_t usb_send_slim_AMP(void){
	uint8_t send_H=(save_dir[send_counter]>>8)&0xFF;
	uint8_t send_L=save_dir[send_counter]&0xFF;
	uint8_t send_buff[3]={25,send_L,send_H};
	usbd_ep_send (&usbd_cdc, CDC_IN_EP, send_buff, 3);
	send_counter++;
	if (send_counter>=puls_counter) return 1;
	else return 0;
}

uint16_t puls_convert(void){
		double level = 0.06;
		uint16_t intervals[50]={0};
		uint8_t buff1[10]={0};
		double first_puls=0;
		int16_t cur_puls=0;
		puls_out=0;
		puls_cur_counter=0;
		if (puls_counter<10) return 0;
		for (int m=3;m<puls_counter-3;m++){
				cur_puls=puls_buff[m]-puls_buff[m-1];
				if (cur_puls>LoLimit & cur_puls<HiLimit){
						first_puls+=cur_puls;
						puls_cur_counter++;
				}
		}		
		first_puls=first_puls/puls_cur_counter;
		
		puls_cur_counter=0;
		for (int m=1;m<puls_counter;m++){
				cur_puls=puls_buff[m]-puls_buff[m-1];
				if (cur_puls>LoLimit & cur_puls<HiLimit & cur_puls*1.5>first_puls & cur_puls/1.5<first_puls){
						puls_out+=cur_puls;
						intervals[puls_cur_counter]=cur_puls;
						puls_cur_counter++;	
				}
		}
		
		double Aver=puls_out/puls_cur_counter;
		double TwentyFivePercent = Aver / 4;
		int Counter = 0;
    double SumSqr = 0;
		for (int i = 0; i < puls_cur_counter; i++){
				double Diff = intervals[i] - Aver;
				if (abs(Diff) < TwentyFivePercent){
						SumSqr += Diff * Diff;
						Counter++;
				}
    }
		
		double SKO = sqrt(SumSqr/Counter);
		if ((SKO/Aver)>level) {
				print_heartX3(true);
		}		
		
		puls_out=60/(puls_out/(puls_cur_counter*frequency));
		return puls_out;
}


void boot_mode(void){
		if (gpio_input_bit_get(GPIOB, GPIO_PIN_0)){     //
				delay_1ms(10);
				if (gpio_input_bit_get(GPIOC, GPIO_PIN_8)){
						gpio_bit_set(GPIOC, GPIO_PIN_9);	
						mode = INIT_START;
				}
				else if (gpio_input_bit_get(GPIOC, GPIO_PIN_10)){
						//gpio_bit_set(GPIOC, GPIO_PIN_9);	
						mode = USB_CHARGING;
				}
		}
}

void bluetooth_check(void){ //works unreliably
		if (finder(UART0_buff,"OK",0,0)) {
			if (bluetooth_status == CONNECTED) {
				bluetooth_status = DISCONNECTED;
				print_bluetooth(true);
			}
		}
		else {
			if (bluetooth_status == DISCONNECTED) {
				print_bluetooth(false);
				bluetooth_status = CONNECTED;	
			}
		}
		my_send_string_UART_0("AT\0\n",strlen("AT\0\n"));			
}

uint8_t finder(uint8_t *buff, uint8_t *_string, uint8_t _char, uint16_t *num){	
		uint8_t _flag=0;
		for (int j=0;j<200;j++){
				if (buff[j]==_string[0]){
						_flag=1;
						for (int k=0;k<strlen(_string);k++){
								if (buff[j+k]!=_string[k]) {
										_flag=0;
										k=strlen(_string);
								}									
						}						
				}
				if (_flag) {
						*num=j;
						buff[j]=_char;
						return 1;
				}
		}
		return 0;
}

uint8_t finder_msg(uint8_t *buff){	
		uint8_t cur_SERIAL[7]={0};
		uint8_t cur_buff[30]={'A','T','+','N','A','M','E','=','T','O','N','O','M'};
		uint8_t _flag=0;
		uint8_t _string[20]={'0','2'};

		//ILI9341_WriteString(1, 30, _string, Font_11x18, ILI9341_RED, ILI9341_WHITE);
		for (int j=0;j<200;j++){
				if (buff[j]==_string[0] & buff[j+1]==_string[1]){
						_flag=1;												
				}
				if (_flag) {
						if (buff[j+2]==0x04){
								uint8_t check_sum=0;
								for (int a=0;a<10;a++){
										check_sum+=buff[j+a];
								}								
								if (buff[j+10]==check_sum){
										SERIAL[2]=cur_SERIAL[0]=buff[j+3];
										SERIAL[3]=cur_SERIAL[1]=buff[j+4];
										SERIAL[4]=cur_SERIAL[2]=buff[j+5];
										SERIAL[5]=cur_SERIAL[3]=buff[j+6];
										SERIAL[6]=cur_SERIAL[4]=buff[j+7];
										SERIAL[7]=cur_SERIAL[5]=buff[j+8];
										SERIAL[8]=cur_SERIAL[6]=buff[j+9];
										
