evgmolt/Tonometer/gd32f303_v1/src/main.c
										fmc_erase_pages();  
										fmc_program();						
									
										buff[j]=0xFF;
									
										delay_1ms(200);									
										device_OFF();
									
										return 1;
								}
						}
						else if (buff[j+2]==0x03){
								uint8_t check_sum=0;
								for (int a=0;a<10;a++){
										check_sum+=buff[j+a];
								}								
								if (buff[j+10]==check_sum){
										cur_day=cur_month=cur_month=cur_year=cur_tss=cur_tmm=cur_thh=0;
										cur_day=(uint16_t)buff[j+3];
										cur_month=(uint16_t)buff[j+4];
										cur_year=(uint16_t)(2000+buff[j+5]);
										cur_tss=(uint32_t)buff[j+6];
										cur_tmm=(uint32_t)buff[j+7];
										cur_thh=(uint32_t)buff[j+8];	
									
										time_set((uint32_t)cur_thh,(uint32_t)cur_tmm,(uint32_t)cur_tss);
										write_backup_register((uint16_t)cur_day, (uint16_t)cur_month, (uint16_t)cur_year);
									
										buff[j]=0xFF;
										return 2;
								}
						}
				}
		}
		return 0;
}

void fmc_erase_pages(void){
    uint32_t EraseCounter;

    /* unlock the flash program/erase controller */
    fmc_unlock();

    /* clear all pending flags */
    fmc_flag_clear(FMC_FLAG_BANK0_END);
    fmc_flag_clear(FMC_FLAG_BANK0_WPERR);
    fmc_flag_clear(FMC_FLAG_BANK0_PGERR);

    /* erase the flash pages */
    for(EraseCounter = 0; EraseCounter < PageNum; EraseCounter++){
        fmc_page_erase(FMC_WRITE_START_ADDR + (FMC_PAGE_SIZE * EraseCounter));
        fmc_flag_clear(FMC_FLAG_BANK0_END);
        fmc_flag_clear(FMC_FLAG_BANK0_WPERR);
        fmc_flag_clear(FMC_FLAG_BANK0_PGERR);
    }

    /* lock the main FMC after the erase operation */
    fmc_lock();
}

void fmc_program(void){
		uint8_t cur_count=0;
    /* unlock the flash program/erase controller */
    fmc_unlock();

    address = FMC_WRITE_START_ADDR;

    /* program flash */
    while(address < FMC_WRITE_END_ADDR){
        fmc_word_program(address, SERIAL[cur_count++]);
        address += 4;
        fmc_flag_clear(FMC_FLAG_BANK0_END);
        fmc_flag_clear(FMC_FLAG_BANK0_WPERR);
        fmc_flag_clear(FMC_FLAG_BANK0_PGERR);
    }

    /* lock the main FMC after the program operation */
    fmc_lock();
}

void fmc_program_check(void){	
		uint8_t cur_SERIAL[7]={0};
		uint8_t cur_buff[30]={'A','T','+','N','A','M','E','=','T','O','N','0','2'};
		uint8_t cur_count=0;
    uint32_t i;

    ptrd = (uint32_t *)FMC_WRITE_START_ADDR;
		
		if((*ptrd) == '0' & (*(ptrd+1)) == '2'){
				SERIAL[2]=cur_SERIAL[0]=*(ptrd+2);	
				SERIAL[3]=cur_SERIAL[1]=*(ptrd+3);
				SERIAL[4]=cur_SERIAL[2]=*(ptrd+4);
				SERIAL[5]=cur_SERIAL[3]=*(ptrd+5);
				SERIAL[6]=cur_SERIAL[4]=*(ptrd+6);
				SERIAL[7]=cur_SERIAL[5]=*(ptrd+7);
				SERIAL[8]=cur_SERIAL[6]=*(ptrd+8);				
		}		
		else{
				SERIAL[0]='0';
				SERIAL[1]='2'; 
				SERIAL[2]='0';	cur_SERIAL[0]='0';
				SERIAL[3]='0';	cur_SERIAL[1]='0';
				SERIAL[4]='0';	cur_SERIAL[2]='0';
				SERIAL[5]='0';	cur_SERIAL[3]='0';
				SERIAL[6]='0';	cur_SERIAL[4]='0';
				SERIAL[7]='0';	cur_SERIAL[5]='0';
				SERIAL[8]='0';	cur_SERIAL[6]='0';
				fmc_erase_pages();
				fmc_program();				
		}		
		strncat(cur_buff,cur_SERIAL,7);
		strncat(cur_buff,"\0\n",2);
		my_send_string_UART_0(cur_buff,strlen(cur_buff));
}

void write_backup_register(uint16_t day, uint16_t month, uint16_t year){
		BKP_DATA10_41(10) = day;
		BKP_DATA10_41(11) = month;
		BKP_DATA10_41(12) = year;
}

void check_backup_register(uint16_t *_day, uint16_t *_month, uint16_t *_year){
		*_day = BKP_DATA_GET(BKP_DATA10_41(10));
		*_month = BKP_DATA_GET(BKP_DATA10_41(11));
		*_year = BKP_DATA_GET(BKP_DATA10_41(12));
}

void send_result_measurement(uint8_t c_day, uint8_t c_month, uint8_t c_year, uint8_t c_ss, uint8_t c_mm, uint8_t c_hh, int16_t sis, int16_t dia, int16_t pressure, int16_t bonus){		
		uint8_t cur_buff[13]={'0','2',0x01, c_day, c_month, c_year, c_ss, c_mm, c_hh, sis, dia, pressure, bonus};		
		uint8_t c_summ=0;		
		for (int q=0;q<13;q++){
				c_summ+=cur_buff[q];
		}			
		cur_buff[13]=c_summ;
		my_send_string_UART_0(cur_buff,14);
}

